---
title: FilterableValueProvider
classe: Autodesk.Revit.DB.FilterableValueProvider
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 11
---

# FilterableValueProvider

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `filterableValueProvider.IsValidObject` | Boolean |
| `Void Dispose()` | `filterableValueProvider.Dispose()` | Void |
| `ElementId GetAssociatedGlobalParameterValue(Element)` | `filterableValueProvider.GetAssociatedGlobalParameterValue(element)` | ElementId |
| `Double GetDoubleValue(Element)` | `filterableValueProvider.GetDoubleValue(element)` | Double |
| `ElementId GetElementIdValue(Element)` | `filterableValueProvider.GetElementIdValue(element)` | ElementId |
| `Int32 GetIntegerValue(Element)` | `filterableValueProvider.GetIntegerValue(element)` | Int32 |
| `String GetStringValue(Element)` | `filterableValueProvider.GetStringValue(element)` | String |
| `Boolean IsDoubleValueSupported(Element)` | `filterableValueProvider.IsDoubleValueSupported(element)` | Boolean |
| `Boolean IsElementIdValueSupported(Element)` | `filterableValueProvider.IsElementIdValueSupported(element)` | Boolean |
| `Boolean IsIntegerValueSupported(Element)` | `filterableValueProvider.IsIntegerValueSupported(element)` | Boolean |
| `Boolean IsStringValueSupported(Element)` | `filterableValueProvider.IsStringValueSupported(element)` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```